import Time from '../libs/time/time';
import CommonLib from '../libs/common/common_lib.js';
import { DateFormatter } from '../libs/date_formatter';
import Server from '../server/server.js';

/**
 * Functions for time storage ititialization and import objects from othe maps
 */

export const initTime = (objects, state) => {
    var mainObject = objects.MAIN;
    var formatter = new DateFormatter(state.labels, state.lang, mainObject.value.dateMode);
    var time = new Time();
    time.init(mainObject.value.dateMode,mainObject.dateBegin,mainObject.dateEnd, state.labels, formatter);

    for(var timeObjectId in objects){

        var timeObjectArray = objects[timeObjectId];
        var timeObject = time.loadTimeObject(timeObjectArray.timeObjectId,timeObjectArray.type,timeObjectArray.dateBegin,
            timeObjectArray.dateEnd,timeObjectArray.value,timeObjectArray.serverHash);

        for(var timeObjectFieldId in timeObjectArray.timeObjectFields){
            var fieldArray = timeObjectArray.timeObjectFields[timeObjectFieldId];
            timeObject.loadTimeObjectField(fieldArray.timeObjectFieldId,fieldArray.type,fieldArray.dateBegin,
                fieldArray.dateEnd,fieldArray.value,fieldArray.serverHash);
        }
    }
    
    time.getIndexStore().reinit();
    migrate(time);
    return time;
}

export const addImportedObjects = function(objects, state){
    var time = state.time.getCopy();

    var units = [];
    for(var objectId in objects){
        var object = objects[objectId];
        var unit = time.addTimeObject(object.type, time.getDateBegin(), time.getDateEnd());
        unit.setValue(object.value);
        unit.setField('eventId', null);
        for(var timeObjectFieldId in object.timeObjectFields){

            if(!unit.timeObjectFields[object.timeObjectFields[timeObjectFieldId].type] &&
                    time.calendar.eQ(object.timeObjectFields[timeObjectFieldId].dateBegin,object.dateBegin)){
                unit.addTimeObjectField(object.timeObjectFields[timeObjectFieldId].type, time.getDateBegin(),
                    object.timeObjectFields[timeObjectFieldId].value);
            }
        }
        units.push(unit);
    }
    return {
        time: time,
        units: units
    };
}

export const saveTableTemplates = function(templates, state){
    var time = state.time.getCopy();
    time.getTimeObjectById('MAIN').setField('unitTableTemplates',templates);
    return time;
}

const migrate = function(time) {
    var server = new Server;
    return;
    var tables = [['1741-06-04','weak','100','75','','0'],['1741-06-05','calm','100','75','','0'],['1741-06-06','weak','100','75','cloudy','0'],['1741-06-07','strong','98','75','clouds,rain','0'],['1741-06-08','strong','97','75','clouds,rain','0'],['1741-06-09','strong','96','75','clouds,rain','0'],['1741-06-10','strong','95','75','clouds,rain','0'],['1741-06-11','strong','94','75','cloudy,sunny','0'],['1741-06-12','strong','93','75','heavy fog, clouds','0'],['1741-06-13','unstable','','75','cloudy','0'],['1741-06-14','weak','','75','cloudy','0'],['1741-06-15','strong','89','75','cloudy,sunny','0'],['1741-06-16','weak','88','75','heavy fog','0'],['1741-06-17','weak','87','75','cloudy','0'],['1741-06-18','underzeil','86','75','cloudy','0'],['1741-06-19','underzeil','85','75','cloudy','0'],['1741-06-20','underzeil','84','75','cloudy,fog','0'],['1741-06-21','weak','83','75','running clouds','0'],['1741-06-22','underzeil','82','75','cloudy','0'],['1741-06-23','strong','81','75','cloudy','0'],['1741-06-24','strong','79','75','','0'],['1741-06-25','strong','78','75','','0'],['1741-06-26','strong','77','75','','0'],['1741-06-27','weak','76','75','','0'],['1741-06-28','weak','75','75','','0'],['1741-06-29','calm','','75','','0'],['1741-06-30','strong','74','75','','0'],['1741-07-01','strong','73','75','','0'],['1741-07-02','weak','72','75','','0'],['1741-07-03','weak','70','75','','0'],['1741-07-04','weak','69','75','','0'],['1741-07-05','weak','68','75','','0'],['1741-07-06','weak','67','75','','0'],['1741-07-07','calm','65','75','','0'],['1741-07-08','','','75','','0'],['1741-07-09','underzeil','64','75','','0'],['1741-07-10','weak','63','75','','0'],['1741-07-11','weak','62','75','','0'],['1741-07-12','underzeil','60','75','','0'],['1741-07-13','weak','59','75','','0'],['1741-07-14','weak','58','75','','0'],['1741-07-15','weak','57','75','','0'],['1741-07-16','weak','56','75','','0'],['1741-07-17','weak','55','75','','0'],['1741-07-18','weak','54','75','','0'],['1741-07-24','weak','47','60','','15'],['1741-07-25','weak','46','60','','0'],['1741-07-26','weak','45','60','','0'],['1741-07-27','strong','45','60','','0'],['1741-07-28','weak','44','60','','0'],['1741-07-29','weak','4','60','','0'],['1741-07-30','underzeil','43','60','','0'],['1741-07-31','strong','3','60','','0'],['1741-08-01','weak','42','60','','0'],['1741-08-02','strong','42','60','','0'],['1741-08-03','calm','41','60','','0'],['1741-08-04','weak','41','60','','0'],['1741-08-05','calm','40','60','','0'],['1741-08-06','unstable','40','60','','0'],['1741-08-07','unstable','39','60','','0'],['1741-08-08','weak','39','60','','0'],['1741-08-09','weak','38','60','','0'],['1741-08-10','weak','38','60','','0'],['1741-08-11','strong','37','60','','0'],['1741-08-12','weak','37','60','','0'],['1741-08-13','weak','36','60','','0'],['1741-08-14','weak','36','60','','0'],['1741-08-15','weak','35','60','','0'],['1741-08-16','weak','35','60','','0'],['1741-08-17','underzeil','34','60','','0'],['1741-08-18','strong','34','60','','0'],['1741-08-19','weak','33','60','','0'],['1741-08-20','weak','33','60','','0'],['1741-08-21','strong','32','60','','0'],['1741-08-22','weak','32','60','','0'],['1741-08-23','weak','31','60','','0'],['1741-08-24','strong','31','60','','0'],['1741-08-25','calm','30','60','','0'],['1741-08-26','calm','30','60','','0'],['1741-08-27','calm','29','60','','0'],['1741-08-28','calm','29','60','','0'],['1741-08-29','weak','28','60','','0'],['1741-08-30','weak','28','60','','0'],['1741-08-31','underzeil','27','60','','0'],['1741-09-01','strong','27','60','','0'],['1741-09-02','underzeil','26','60','','0'],['1741-09-03','weak','26','60','','0'],['1741-09-04','weak','25','60','','0'],['1741-09-05','weak','24','60','','0'],['1741-09-06','weak','24','60','','0'],['1741-09-07','underzeil','23','60','','0'],['1741-09-08','underzeil','22','60','','0'],['1741-09-09','weak','22','60','','0'],['1741-09-10','weak','21','60','','0'],['1741-09-11','weak','20','60','','0'],['1741-09-12','weak','19','60','','0'],['1741-09-13','weak','18','60','','0'],['1741-09-14','weak','17','60','','0'],['1741-09-15','underzeil','17','60','','0'],['1741-09-16','underzeil','16','59','','1'],['1741-09-17','underzeil','15','59','','0'],['1741-09-18','weak','14','59','','0'],['1741-09-19','weak','14','59','','0'],['1741-09-20','weak','13','59','','0'],['1741-09-21','weak','12','59','','0'],['1741-09-22','underzeil','11','59','','0'],['1741-09-23','underzeil','10','59','','0'],['1741-09-24','strong','9','59','','0'],['1741-09-25','strong','8','59','','0'],['1741-09-26','storm','7','58','','1'],['1741-09-27','storm','6','58','','0'],['1741-09-28','storm','6','58','','0'],['1741-09-29','storm','5','58','','0'],['1741-09-30','storm','5','58','','0'],['1741-10-01','storm','5','58','','0'],['1741-10-02','underzeil','4','58','','0'],['1741-10-03','underzeil','4','58','','0'],['1741-10-04','weak','3','58','','0'],['1741-10-05','strong','3','58','','0'],['1741-10-06','calm','2','58','','0'],['1741-10-07','storm','2','56','','2'],['1741-10-08','storm','1','55','','1'],['1741-10-09','strong','1','55','',''],['1741-10-10','weak','1','54','','1']];
  //  var tables = [['1741-06-04','weak','100','75','','0'],['1741-06-05','calm','100','75','','0'],['1741-06-06','weak','100','75','cloudy','0'],['1741-06-07','strong','98','75','clouds,rain','0'],['1741-06-08','strong','97','75','clouds,rain','0'],['1741-06-09','strong','96','75','clouds,rain','0'],['1741-06-10','strong','95','75','clouds,rain','0'],['1741-06-11','strong','94','75','cloudy,sunny','0'],['1741-06-12','strong','93','75','heavy fog, clouds','0'],['1741-06-12','weak','93','75','heavy fog, clouds','0'],['1741-06-13','unstable','','75','cloudy','0'],['1741-06-14','weak','','75','cloudy','0'],['1741-06-15','strong','89','75','cloudy,sunny','0'],['1741-06-16','weak','88','75','heavy fog','0'],['1741-06-17','weak','87','75','cloudy','0'],['1741-06-18','underzeil','86','75','cloudy','0'],['1741-06-19','underzeil','85','75','cloudy','0'],['1741-06-20','underzeil','84','75','cloudy,fog','0'],['1741-06-21','weak','83','75','running clouds','0'],['1741-06-22','underzeil','82','75','cloudy','0'],['1741-06-23','strong','81','75','cloudy','0'],['1741-06-24','strong','79','75','','0'],['1741-06-25','strong','78','75','','0'],['1741-06-26','strong','77','75','','0'],['1741-06-27','weak','76','75','','0'],['1741-06-28','weak','75','75','','0'],['1741-06-29','calm','','75','','0'],['1741-06-30','strong','74','75','','0'],['1741-07-01','strong','73','75','','0'],['1741-07-02','weak','72','75','','0'],['1741-07-03','weak','70','75','','0'],['1741-07-04','weak','69','75','','0'],['1741-07-05','weak','68','75','','0'],['1741-07-06','weak','67','75','','0'],['1741-07-07','calm','65','75','','0'],['1741-07-08','','','75','','0'],['1741-07-09','underzeil','64','75','','0'],['1741-07-10','weak','63','75','','0'],['1741-07-11','weak','62','75','','0'],['1741-07-12','underzeil','60','75','','0'],['1741-07-13','weak','59','75','','0'],['1741-07-14','weak','58','75','','0'],['1741-07-15','weak','57','75','','0'],['1741-07-16','weak','56','75','','0'],['1741-07-17','weak','55','75','','0'],['1741-07-18','weak','54','75','','0'],['1741-07-24','weak','47','60','','15'],['1741-07-25','weak','46','60','','0'],['1741-07-26','weak','45','60','','0'],['1741-07-27','strong','45','60','','0']];
     //var tables = [['1741-06-04','weak','100','75','','0']];
    var army = time.getTimeObjectById('arm1606212198383.740');
   
    for(var i=0; i < tables.length; i++ ){
        var table = tables[i];
        console.log(table);
        var dateArr = table[0].split('-');
        var tableDate = {year:parseInt(dateArr[0]),month:parseInt(dateArr[1]),day:parseInt(dateArr[2])};
       
        var preparedTable = [
            {'name':'Сила ветра', 'value':table[1]},
            {'name':'Вода', 'value':table[2]},
            {'name':'Экипаж', 'value':table[3]},
            {'name':'Облака', 'value':table[4]},
            {'name':'Погибло', 'value':table[5]},
        ];
        if(i == 0) {
       var timeObjectField = army.getTimeObjectField('dynamicTable', 'dynamicTab1606212198384.931');
            timeObjectField.setValue(preparedTable); 
        }
        else {
        army.addTimeObjectField('dynamicTable',tableDate, preparedTable);
        }
    }
    
    return;   
    var eventDescrs = [['1741-06-04','В 6 часу прошли устье Авачинской губы в море'],['1741-06-12','Окончание поиска островов Иаса де Гама'],['1741-06-21','Два корабля разошлись'],['1741-06-23','Продолжение пути в одиночестве'],['1741-07-12','Видели утку, земля близко'],['1741-07-15','Увидели Америку'],['1741-07-18','Отправили лодку'],['1741-07-25','Уплывают без части команды'],['1741-07-26','Держать курс прямо к своей гавани Св. апостол Петра и Павла. Осталось воды 45 бочек'],['1741-09-09','В начале часа оказалися гребущих к нам 7 малых лодок, в которых сидит по 1-у человеку.'],['1741-09-12','Осматривали, сколько в судне имеетца бочек пресной воды, которые нашлись средней и малой руки, а по счислению надлежит быть 19 бочек'],['1741-09-16','Служивой из сильных, которой был в числе парусника, Михаил Усачев, цынготною болезнию умре, которого бросили в море. Все служители от недов?'],['1741-09-18','Небо чисто и сияние солнца'],['1741-09-21','В начале 10 часа увидели мы берег земли, прямо против нас, которая нам кажетца, повидимому, что не Камчатскаая земля.'],['1741-09-22','Ветер марселевой, небо чисто и сияние солнца'],['1741-09-26','Подконстапел Осип Калчиков цынготною болезнею умре, которого бросили в море'],['1741-09-27','Господин капитан Чириков, лейтенант Чихачев, Плаутин, астрономии профессор де ла Кроер, из служителей рядовых 12 человек жестоко одержаны ц'],['1741-09-28','...понеже воды пресной при судне осталось только малой руки 6 бочек и служителям дается в день по 5 чарок а каш не варят'],['1741-09-30','Шторм великой с великими шквалами, дождем и снегом... выбрасывает на палубу мелкую рыбку...'],['1741-10-01','Шторм, дрейфовали под бизанью'],['1741-10-02','По счислению имелось воды в судне пресной 5 бочек на токмо, а смотрели, что на одной треснули обручи и вода вся вытекла, только осталось 4 боч'],['1741-10-04','... дождь велик, служители удовольствовались дождевою водою от жажды и накопили в бочку ведер 7'],['1741-10-05','Небо облачно и снег великой со стужею великою и служители, обессиля в такой стуже, с великою нуждою верховые работы исправляют'],['1741-10-07','Лейтенант Иван Чихачев и якутщик житель Василей Нижегородов жестокою цинготною болезнею умре'],['1741-10-08','Штюрман в ранге лейтенант Михайла Плаутин жестокою цынготною болезнию умре'],['1741-10-10','Астрономии профессов де ла Кроер жестокою цынготною болезнию умре. Капитан господин Чириков отбыл на шлюпке на берег в жестокой цынготной']];
    
     for(var i=0; i < eventDescrs.length; i++ ){
        var eventDescr = eventDescrs[i];
        var dateArr = eventDescr[0].split('-');
        var eventDate = {year:parseInt(dateArr[0]),month:parseInt(dateArr[1]),day:parseInt(dateArr[2])};
        
        var event = time.addTimeObject('event', eventDate, eventDate);
        event.setField('mapZoom', 4);
        event.setField('arrowPoint',{lng:158.9223, lat:52.86362});
        event.setField('name','событие '+(i+1));
        event.setField('description',eventDescr[1]);
        event.setField('showMarker',false);
        event.setField('disableAnimation',false);
        time.getIndexStore().reinit();
    }
      
return;    

    var army = time.getTimeObjectById('arm1606212198383.740');
    var points = [['1741-06-04','158.6626','52.89431'],['1741-06-05','159.6928','52.21338'],['1741-06-06','159.9176','52.06496'],['1741-06-07','162.7977','51.00209'],['1741-06-08','165.6213','49.94941'],['1741-06-09','168.0611','48.81178'],['1741-06-10','170.0919','47.79641'],['1741-06-11','171.5248','47.0229'],['1741-06-12','172.563','46.17296'],['1741-06-12','173.0383','46.19197'],['1741-06-13','173.0868','46.28406'],['1741-06-14','173.4688','46.99007'],['1741-06-15','173.913','47.77017'],['1741-06-16','174.4264','48.19799'],['1741-06-17','175.8525','48.58779'],['1741-06-18','177.4497','49.2628'],['1741-06-19','178.7655','49.76668'],['1741-06-20','178.1','49.19625'],['1741-06-21','178.0239','48.52124'],['1741-06-22','179.1268','48.03637'],['1741-06-23','-179.008','48.14965'],['1741-06-24','-175.916','48.01274'],['1741-06-25','-172.699','48.19528'],['1741-06-26','-169.664','48.19528'],['1741-06-27','-167.588','48.53754'],['1741-06-28','-165.14','48.95934'],['1741-06-29','-162.683','49.47863'],['1741-06-30','-160.71','49.85302'],['1741-07-01','-157.367','50.52803'],['1741-07-02','-154.831','51.03857'],['1741-07-03','-154.768','51.05175'],['1741-07-04','-153.831','51.2495'],['1741-07-05','-151.994','51.60697'],['1741-07-06','-149.332','52.09374'],['1741-07-07','-148.176','52.25346'],['1741-07-08','-147.755','52.66282'],['1741-07-09','-147.397','53.00338'],['1741-07-10','-145.389','53.27719'],['1741-07-11','-144.461','53.40649'],['1741-07-12','-141.388','54.39524'],['1741-07-13','-138.208','54.80595'],['1741-07-14','-135.743','55.20145'],['1741-07-15','-134.056','55.53861'],['1741-07-16','-134.802','56.20388'],['1741-07-17','-136.553','57.73247'],['1741-07-18','-136.585','57.85341'],['1741-07-24','-136.603','57.85578'],['1741-07-25','-138.423','57.51755'],['1741-07-26','-138.538','58.18781'],['1741-07-27','-141.79','58.69216'],['1741-07-28','-143.406','58.73494'],['1741-07-29','-145.171','59.22932'],['1741-07-30','-147.662','58.81575'],['1741-07-31','-149.744','59.09622'],['1741-08-01','-150.423','58.99164'],['1741-08-02','-150.556','58.37367'],['1741-08-03','-151.063','57.57591'],['1741-08-04','-150.995','57.05511'],['1741-08-05','-151.987','56.9182'],['1741-08-06','-152.033','56.54742'],['1741-08-07','-151.996','56.544'],['1741-08-08','-151.343','56.07602'],['1741-08-09','-151.343','55.05115'],['1741-08-10','-151.99','53.95782'],['1741-08-11','-152.636','53.26047'],['1741-08-12','-152.95','53.1036'],['1741-08-13','-153.397','53.22244'],['1741-08-14','-154.043','52.52509'],['1741-08-15','-154.49','52.37773'],['1741-08-16','-154.652','52.59164'],['1741-08-17','-155.175','53.02897'],['1741-08-18','-154.937','52.45379'],['1741-08-19','-155.546','52.21611'],['1741-08-20','-156.059','52.01645'],['1741-08-21','-156.716','51.6143'],['1741-08-22','-156.735','52.1467'],['1741-08-23','-157.106','52.19899'],['1741-08-24','-157.591','52.30833'],['1741-08-25','-157.201','52.00885'],['1741-08-26','-156.916','51.96607'],['1741-08-27','-157.087','51.90427'],['1741-08-28','-157.163','51.71888'],['1741-08-29','-157.534','51.97557'],['1741-08-30','-157.41','52.45569'],['1741-08-31','-159.953','52.63989'],['1741-09-01','-162.916','52.90181'],['1741-09-02','-165.414','53.11858'],['1741-09-03','-165.939','52.80484'],['1741-09-04','-167.924','52.7535'],['1741-09-05','-169.088','52.18877'],['1741-09-06','-170.069','51.6982'],['1741-09-07','-172.152','51.62405'],['1741-09-08','-175.928','51.59552'],['1741-09-09','-176.864','51.61682'],['1741-09-10','-176.51','51.17911'],['1741-09-11','-176.795','50.7741'],['1741-09-12','-177.868','51.13918'],['1741-09-13','-178.644','50.95094'],['1741-09-14','179.6782','50.57289'],['1741-09-15','177.6246','51.08628'],['1741-09-16','176.3887','52.10354'],['1741-09-17','176.0654','51.44755'],['1741-09-18','175.4189','52.4363'],['1741-09-19','175.0159','52.46491'],['1741-09-20','174.6622','52.48764'],['1741-09-21','173.7799','52.27467'],['1741-09-22','172.8368','51.81833'],['1741-09-23','173.4757','51.47607'],['1741-09-24','172.2131','51.55213'],['1741-09-25','171.4373','51.11099'],['1741-09-26','170.1748','51.9172'],['1741-09-27','170.9049','51.36959'],['1741-09-28','171.1027','50.95127'],['1741-09-29','169.8706','51.84115'],['1741-09-30','169.2188','51.61926'],['1741-10-01','169.7207','51.08685'],['1741-10-02','168.011','51.36827'],['1741-10-03','166.7864','51.75236'],['1741-10-04','164.8394','52.91756'],['1741-10-05','163.5996','52.34332'],['1741-10-06','163.6586','52.04145'],['1741-10-07','161.216','52.66276'],['1741-10-08','159.5275','52.89854'],['1741-10-09','159.5351','52.82249'],['1741-10-10','158.9223','52.86362']];
    var preparedPoints = [];
    for(var i=0; i < points.length; i++ ){
        var point = points[i];
        var dateArr = point[0].split('-');
         console.log(dateArr);
        preparedPoints.push({
            lat: parseFloat(point[2]),
            lng:parseFloat(point[1]),
            date: {year:parseInt(dateArr[0]),month:parseInt(dateArr[1]),day:parseInt(dateArr[2])}
        })
    }

    console.log(preparedPoints);
army.setField('pointsWithDates', preparedPoints);
 return;
    var desrs = {
   };
     return;
    var citys = time.getObjectsOfType('region');
    for(var i=0; i < citys.length; i++ ){
        var descr = desrs[citys[i].getField('name')];
        if(descr){
            (function(city) { server.saveArticle(descr, function(response){
                city.setField('article', response.articleId);
                city.setField('progress',90);
                console.log(city.getField('name'));
            });
            })(citys[i]);
        }
    }
    
    
    return;
    var regions = time.getObjectsOfType('region');
    for(var i=0; i < regions.length; i++ ){
        var region = regions[i];
        var articleId = region.getField('article');
        if(articleId){
            server.getArticleText(articleId, function(article){
                article = article.replace(/<br>/g, "\n");
                if(article && article != '') {
                    console.log(region.getField('name'));
                    region.setField('progress',90);
                }
            });
        }
 
    }
    
    
    var events = time.getObjectsOfType('event');
    var emptyEvents = [];
    for(var i=0; i < events.length; i++ ){
        if(!events[i].getField('description')) {
            emptyEvents.push(events[i].getField('name'));
        }
    }
    console.log(emptyEvents);
    
    
    return;
    var lines = time.getObjectsOfType('line');
    for(var i=0; i < lines.length; i++ ){
        var ters = lines[i].getTimeObjectsFieldsArray('dynamicTerritory', false)
        for(var j=0; j < ters.length; j++ ){
             var value = ters[j].getValue();
             if(!value.branchs) {
                 value.branchs = [value.points];
                 console.log(lines[i].getField('name'), value);
             }
             
        }
    }
    
//    return;
//    var index = time.getIndexStore().getIndexByStories();
//    var events =  index[1].events;
//    events.sort(function (event1, event2) {
//        var step1 = time.getCalendar().getStepByDate(event1.getDateBegin());
//        var step2 = time.getCalendar().getStepByDate(event2.getDateBegin());
//        return step1 - step2;
//    });
//   
//    
//    for(var i=0; i < events.length; i++ ){
//        var chains = events[i].getField('eventChains');
//        console.log(chains['chain_1554995519532.321']);
//        chains['chain_1554995519532.321'].order = i+1;
//    }
//    //  console.log(events);
//    time.getIndexStore().reinit();
           //return;
//    var events = time.getObjectsOfType('event');
//    for(var i=0; i < events.length; i++ ){
//        events[i].setField('arrowPoint',events[i].getField('mapCenter'));
//    }
    
//    var regions = time.getObjectsOfType('region');
//    for(var i=0; i < regions.length; i++ ){
//        regions[i].getField('staticStyle').hasLabel = false;
//        console.log(regions[i].getField('name'),regions[i].getField('staticStyle'));
//    }
} 
